app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all.page(params[:page]).per(5)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "cocktails" WHERE "cocktails"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @cocktails = @user.cocktails.page(params[:page]).per(5)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["updated_at", "2021-10-11 09:20:59.220990"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user == current_user
      @user.update(user_params)